<template>
  <Menu :active-name="activeByUrl" :accordion="true" :open-names="[$route.path.split('/')[1]]">
    <MenuItem name="dashboard" to="/">
      <div class="wrapper-icon">
        <svg xmlns="http://www.w3.org/2000/svg" width="24" height="24" viewBox="0 0 24 24">
          <g class="a" transform="translate(1 0.99)">
            <g transform="translate(-1 -0.991)">
              <path
                class="a"
                d="M22.673,9.269,11.777-.636l-.1-.095a1,1,0,0,0-.233-.158l-.011,0a1,1,0,0,0-.857,0l-.011,0a1,1,0,0,0-.233.158l-.1.093L-.673,9.269A1,1,0,0,0-.74,10.682a1,1,0,0,0,1.413.067l.327-.3V22.01a1,1,0,0,0,1,1H20a1,1,0,0,0,1-1V10.452l.327.3a1,1,0,0,0,1.345-1.48ZM9,21.01v-6a2,2,0,1,1,4,0v6Zm10,0H15v-6a4,4,0,1,0-8,0v6H3V8.634l8-7.273,8,7.273Z"
                transform="translate(1 0.991)"
              />
            </g>
          </g>
        </svg>
      </div>หน้าหลัก
    </MenuItem>

    <!-- <Submenu name="search">
      <template slot="title">
        <div class="wrapper-icon">
          <svg
            xmlns="http://www.w3.org/2000/svg"
            width="28.991"
            height="28.991"
            viewBox="0 0 28.991 28.991"
          >
            <path
              class="a"
              d="M7.846,24V17.635A8.3,8.3,0,0,1,2.49,15.074,8.948,8.948,0,0,1,0,8.83,8.948,8.948,0,0,1,2.49,2.586a8.277,8.277,0,0,1,12.021,0A8.948,8.948,0,0,1,17,8.83a8.948,8.948,0,0,1-2.49,6.244,8.3,8.3,0,0,1-5.357,2.561V24ZM1.308,8.83A7.344,7.344,0,0,0,8.5,16.3,7.344,7.344,0,0,0,15.692,8.83,7.344,7.344,0,0,0,8.5,1.358,7.345,7.345,0,0,0,1.308,8.83Z"
              transform="translate(0 12.021) rotate(-45)"
            />
          </svg>
        </div>ค้นหาข้อมูล
      </template>
      <MenuItem name="search-customer" to="/search/search-customer">ค้นหาลูกค้า</MenuItem>
      <MenuItem name="search-car" to="/search/search-car">ค้นหารถยนต์</MenuItem>
      <MenuItem name="search-dealer" to="/search/search-dealer">ค้นหาผู้จำหน่วย</MenuItem>
      <MenuItem name="search-product" to="/search/search-product">ค้นหาสินค้า</MenuItem>
    </Submenu> -->

    <Submenu name="sales">
      <template slot="title">
        <div class="wrapper-icon">
          <svg
            id="Group_1455"
            data-name="Group 1455"
            xmlns="http://www.w3.org/2000/svg"
            xmlns:xlink="http://www.w3.org/1999/xlink"
            width="24.484"
            height="24.491"
            viewBox="0 0 24.484 24.491"
          >
            <defs>
              <clipPath id="clip-path">
                <rect
                  id="Rectangle_1871"
                  data-name="Rectangle 1871"
                  width="24.484"
                  height="24.491"
                />
              </clipPath>
            </defs>
            <g id="Group_1454" data-name="Group 1454" clip-path="url(#clip-path)">
              <path
                class="a"
                id="Path_799"
                data-name="Path 799"
                d="M219.04,331.009a.479.479,0,1,0-.677,0,.479.479,0,0,0,.677,0"
                transform="translate(-207.785 -314.398)"
              />
              <path
                class="a"
                id="Path_800"
                data-name="Path 800"
                d="M187.949,5.26A5.26,5.26,0,1,0,193.209,0a5.266,5.266,0,0,0-5.26,5.26m9.564,0a4.3,4.3,0,1,1-4.3-4.3,4.309,4.309,0,0,1,4.3,4.3"
                transform="translate(-178.959)"
              />
              <path
                class="a"
                id="Path_801"
                data-name="Path 801"
                d="M5.508,226.512a.478.478,0,0,0,.675,0L8.5,224.232a1.445,1.445,0,0,0,.34-1.484l.5-.481a1.426,1.426,0,0,1,1-.4h6.357a4.282,4.282,0,0,0,3-1.22c.033-.032-.252.3,4.337-5.181a1.913,1.913,0,0,0-2.911-2.483l-2.822,2.9a1.922,1.922,0,0,0-1.487-.712H11.481a6.17,6.17,0,0,0-2.395-.478,5.916,5.916,0,0,0-5.393,3.058,1.428,1.428,0,0,0-1.279.4L.139,220.427a.478.478,0,0,0,0,.675Zm3.578-10.864a5.221,5.221,0,0,1,2.105.438.477.477,0,0,0,.192.04h5.431a.956.956,0,1,1,0,1.913h-3.9a.478.478,0,1,0,0,.956h3.9a1.91,1.91,0,0,0,1.9-2.163c2.73-2.806,3.115-3.2,3.131-3.22a.957.957,0,1,1,1.46,1.236l-4.289,5.128a3.33,3.33,0,0,1-2.318.932H10.336a2.377,2.377,0,0,0-1.66.67l-.406.392-3.746-3.746a4.937,4.937,0,0,1,4.562-2.577m-5.995,3.174a.477.477,0,0,1,.592-.067c.083.05-.155-.166,4.142,4.125a.479.479,0,0,1,0,.674L5.851,225.5l-4.7-4.735Z"
                transform="translate(0 -202.162)"
              />
              <path
                class="a"
                id="Path_802"
                data-name="Path 802"
                d="M266.273,40.466v.56a1.435,1.435,0,0,0,.478,2.787.478.478,0,0,1,0,.956.865.865,0,0,1-.621-.362.478.478,0,0,0-.732.615,1.983,1.983,0,0,0,.875.623V46.2a.478.478,0,0,0,.956,0v-.56a1.435,1.435,0,0,0-.478-2.787.478.478,0,0,1,0-.957.768.768,0,0,1,.517.25.478.478,0,0,0,.665-.687,1.847,1.847,0,0,0-.7-.44v-.557a.478.478,0,1,0-.956,0"
                transform="translate(-252.596 -38.075)"
              />
            </g>
          </svg>
        </div>ขาย
      </template>
      <MenuItem name="service-request" to="/sales/service-request">ใบสั่งซ่อม</MenuItem>
      <MenuItem
        name="tax-Invoice-abb"
        to="/sales/tax-Invoice-abb"
      >ใบเสร็จรับเงิน/ใบกำกับภาษี(อย่างย่อ)</MenuItem>
      <!-- <MenuItem name="temporary-order" to="/sales/temporary-order">ใบส่งสินค้าชั่วคราว</MenuItem> -->
      <!-- <MenuItem name="tax-invoice" to="/sales/tax-invoice">ใบกำกับภาษีเต็มรูป</MenuItem> -->
      <!-- <MenuItem name="return-order-slip" to="/sales/return-order-slip">ใบลดหนี้/รับคืนสินค้า</MenuItem> -->
      <MenuItem name="quotation" to="/sales/quotation">ใบเสนอราคา</MenuItem>
      <!-- <MenuItem name="deposit-slip" to="/sales/deposit-slip">ใบรับมัดจำ</MenuItem> -->
      <!-- <MenuItem name="car-inspection-list" to="/sales/car-inspection-list">ใบตรวจสอบสภาพรถยนต์</MenuItem> -->
    </Submenu>

    <!-- <MenuItem name="purchase" to="/purchase">
      <div class="wrapper-icon">
        <svg xmlns="http://www.w3.org/2000/svg" width="24" height="20.625" viewBox="0 0 24 20.625">
          <g transform="translate(0 -36.002)">
            <path
              class="a"
              d="M23.625,39.254a1.68,1.68,0,0,0-1.313-.627H4.019l-.163-1.171A1.7,1.7,0,0,0,2.184,36H.75a.75.75,0,0,0,0,1.5H2.184a.188.188,0,0,1,.186.162L4.394,52.173a1.7,1.7,0,0,0,1.671,1.454h.813a2.25,2.25,0,1,0,4.242,0h4.008a2.25,2.25,0,1,0,4.242,0H21a.75.75,0,1,0,0-1.5H6.066a.188.188,0,0,1-.186-.162l-.187-1.338H20.464a1.7,1.7,0,0,0,1.65-1.334l1.848-8.625a1.68,1.68,0,0,0-.337-1.414ZM9.75,54.377a.75.75,0,1,1-.75-.75A.751.751,0,0,1,9.75,54.377Zm8.25,0a.75.75,0,1,1-.75-.75A.751.751,0,0,1,18,54.377Zm4.5-14.023-1.848,8.625a.189.189,0,0,1-.184.149H5.484l-1.256-9H22.312a.187.187,0,0,1,.184.227Z"
            />
          </g>
        </svg>
      </div>จัดซื้อ
    </MenuItem> -->

    <!-- <Submenu name="warehouse">
      <template slot="title">
        <div class="wrapper-icon">
          <svg xmlns="http://www.w3.org/2000/svg" width="23.92" height="24" viewBox="0 0 23.92 24">
            <g transform="translate(-0.301)">
              <path
                class="a"
                d="M232.3,201.6H233.9v.8H232.3Zm0,0"
                transform="translate(-220.439 -191.555)"
              />
              <path
                class="a"
                d="M328.3,201.6H329.9v.8H328.3Zm0,0"
                transform="translate(-311.655 -191.555)"
              />
              <path
                class="a"
                d="M328.3,265.6H329.9v.8H328.3Zm0,0"
                transform="translate(-311.655 -252.366)"
              />
              <path
                class="a"
                d="M232.3,265.6H233.9v.8H232.3Zm0,0"
                transform="translate(-220.439 -252.366)"
              />
              <path
                class="a"
                d="M232.3,329.6H233.9v.8H232.3Zm0,0"
                transform="translate(-220.439 -313.177)"
              />
              <path
                class="a"
                d="M328.3,329.6H329.9v.8H328.3Zm0,0"
                transform="translate(-311.655 -313.177)"
              />
              <path
                class="a"
                d="M320.3,433.6h.8v.8h-.8Zm0,0"
                transform="translate(-304.054 -411.994)"
              />
              <path
                class="a"
                d="M23.025,6.219,12.261,0,1.5,6.219v9.807h.8V6.7L12.261.957,22.227,6.7V23.2H18.241a1.605,1.605,0,0,0,.359-.8h1.635a1.175,1.175,0,0,0,1.2-1.2V19.216a1.175,1.175,0,0,0-1.2-1.2V9.648a1.192,1.192,0,0,0-1.156-1.2H11.025a1.192,1.192,0,0,0-1.156,1.2V18.02h-.8V11.243h-.8v.8H6.36a1.149,1.149,0,0,0-1.036.638L2.453,18.06a.917.917,0,0,0-.159.558v2.591a1.175,1.175,0,0,0,1.2,1.2h.837a2.877,2.877,0,0,0,.359.8H.3V24h23.92v-.8h-1.2ZM8.234,22.405h6.459a2.877,2.877,0,0,0,.359.8H7.875a2.883,2.883,0,0,0,.359-.8Zm7.216-.4a1.2,1.2,0,1,1,1.2,1.2A1.175,1.175,0,0,1,15.45,22.007Zm0-3.987V15.628h3.987V18.02Zm0-5.581h3.987v2.392H15.45Zm-.8,2.392H10.666V12.439h3.987Zm4.784-5.183v1.993H15.45V9.249h3.628a.393.393,0,0,1,.359.4Zm-8.412-.4h3.628v2.392H10.666V9.648A.393.393,0,0,1,11.025,9.249Zm-.359,6.379h3.987V18.02H10.666ZM6,13.037a.418.418,0,0,1,.359-.2H8.274V18.02H3.37Zm-2.91,8.173V18.817H20.234a.377.377,0,0,1,.4.4v1.993a.377.377,0,0,1-.4.4H18.6a1.992,1.992,0,0,0-2.352-1.555,1.956,1.956,0,0,0-1.555,1.555H8.234a1.992,1.992,0,0,0-2.352-1.555,1.956,1.956,0,0,0-1.555,1.555H3.49a.377.377,0,0,1-.4-.4Zm1.993.8a1.2,1.2,0,1,1,1.2,1.2A1.175,1.175,0,0,1,5.085,22.007Zm0,0"
              />
              <path
                class="a"
                d="M112.3,433.6h.8v.8h-.8Zm0,0"
                transform="translate(-106.419 -411.994)"
              />
              <path
                class="a"
                d="M197.085,49.435,194.693,48,192.3,49.435v3.429h4.784Zm-3.987.478,1.2-.718v2.87h-1.2Zm3.189,2.153h-1.2V49.2l1.2.718Zm0,0"
                transform="translate(-182.432 -45.608)"
              />
            </g>
          </svg>
        </div>คลังสินค้า
      </template>
      <MenuItem name="import-order" to="/warehouse/import-order">ใบรับเข้าสินค้า</MenuItem>
      <MenuItem name="return-order" to="/warehouse/return-order">ใบส่งคืนสินค้า</MenuItem>
      <MenuItem name="update-stock" to="/warehouse/update-stock">ใบปรับลดปรับเพิ่ม</MenuItem>
      <MenuItem name="caim-product" to="/warehouse/caim-product">ใบรับเคลมสินค้า</MenuItem>
      <MenuItem name="stocktaking" to="/warehouse/stocktaking">ใบเช็คสต๊อกสินค้า</MenuItem>
    </Submenu> -->
<!-- 
    <Submenu name="cost-consumables">
      <template slot="title">
        <div class="wrapper-icon">
          <svg
            xmlns="http://www.w3.org/2000/svg"
            xmlns:xlink="http://www.w3.org/1999/xlink"
            width="25"
            height="25"
            viewBox="0 0 25 25"
          >
            <defs>
              <clipPath id="clip-path">
                <rect
                  class="a"
                  id="Rectangle_1879"
                  data-name="Rectangle 1879"
                  width="25"
                  height="25"
                  transform="translate(0 -0.002)"
                />
              </clipPath>
            </defs>
            <g id="Group_1456" data-name="Group 1456" transform="translate(0 -0.263)">
              <g
                id="Group_1460"
                data-name="Group 1460"
                transform="translate(0 0.265)"
                clip-path="url(#clip-path)"
              >
                <path
                  class="a"
                  id="Path_807"
                  data-name="Path 807"
                  d="M154.273,235.53l-.925-.307a.745.745,0,0,1-.509-.707.839.839,0,0,1,1.678,0h.839A1.678,1.678,0,0,0,154.1,232.9V232h-.839v.9A1.678,1.678,0,0,0,152,234.516a1.582,1.582,0,0,0,1.082,1.5l.925.307a.745.745,0,0,1,.509.707.839.839,0,0,1-1.678,0H152a1.678,1.678,0,0,0,1.258,1.618v.9h.839v-.9a1.678,1.678,0,0,0,1.258-1.618,1.582,1.582,0,0,0-1.082-1.5"
                  transform="translate(-144.032 -220.001)"
                />
                <path
                  class="a"
                  id="Path_808"
                  data-name="Path 808"
                  d="M24.744,9.227H16.265A9.657,9.657,0,0,0,13,6.632V4.823l1.51-1.132a.419.419,0,0,0,.168-.336V.419A.419.419,0,0,0,14.259,0H12.582a.419.419,0,0,0-.3.123l-.542.542L11.2.123A.419.419,0,0,0,10.9,0H8.388a.419.419,0,0,0-.3.123L7.549.665,7.007.123A.419.419,0,0,0,6.71,0H5.033a.419.419,0,0,0-.419.419V3.355a.419.419,0,0,0,.168.336l1.51,1.132V6.636C3.116,8.173,0,12.3,0,17.591c0,4.812,3.516,7.572,9.646,7.572a16.193,16.193,0,0,0,2.967-.263.419.419,0,0,0,.388.263H24.744a.419.419,0,0,0,.419-.419V9.646a.419.419,0,0,0-.419-.419M5.452,3.145V.839H6.537l.716.716a.419.419,0,0,0,.593,0L8.561.839H10.73l.716.716a.419.419,0,0,0,.593,0l.716-.716H13.84V3.145l-1.4,1.048H6.85Zm6.71,3.145H7.13V5.033h5.033Zm.419,13.2a4.613,4.613,0,1,1,0-7.107V19.49Zm0-9.844v1.7a5.452,5.452,0,1,0,0,9.178v3.527a15.273,15.273,0,0,1-2.936.272C7,24.324.839,23.669.839,17.591c0-4.012,2.4-9,6.431-10.462h4.755a8.262,8.262,0,0,1,3.117,2.1H13a.419.419,0,0,0-.419.419M24.324,24.324H13.42V13.42h10.9Zm0-11.743H13.42V10.065h10.9Z"
                  transform="translate(0 -0.163)"
                />
                <path
                  class="a"
                  id="Path_809"
                  data-name="Path 809"
                  d="M274.1,272h-1.678a.419.419,0,0,0-.419.419V274.1a.419.419,0,0,0,.419.419H274.1a.419.419,0,0,0,.419-.419v-1.678A.419.419,0,0,0,274.1,272m-.419,1.678h-.839v-.839h.839Z"
                  transform="translate(-257.741 -257.904)"
                />
                <path
                  class="a"
                  id="Path_810"
                  data-name="Path 810"
                  d="M338.1,272h-1.678a.419.419,0,0,0-.419.419V274.1a.419.419,0,0,0,.419.419H338.1a.419.419,0,0,0,.419-.419v-1.678A.419.419,0,0,0,338.1,272m-.419,1.678h-.839v-.839h.839Z"
                  transform="translate(-318.386 -257.904)"
                />
                <path
                  class="a"
                  id="Path_811"
                  data-name="Path 811"
                  d="M402.1,272h-1.678a.419.419,0,0,0-.419.419V274.1a.419.419,0,0,0,.419.419H402.1a.419.419,0,0,0,.419-.419v-1.678A.419.419,0,0,0,402.1,272m-.419,1.678h-.839v-.839h.839Z"
                  transform="translate(-379.031 -257.904)"
                />
                <path
                  class="a"
                  id="Path_812"
                  data-name="Path 812"
                  d="M274.1,336h-1.678a.419.419,0,0,0-.419.419V338.1a.419.419,0,0,0,.419.419H274.1a.419.419,0,0,0,.419-.419v-1.678A.419.419,0,0,0,274.1,336m-.419,1.678h-.839v-.839h.839Z"
                  transform="translate(-257.741 -318.549)"
                />
                <path
                  class="a"
                  id="Path_813"
                  data-name="Path 813"
                  d="M338.1,336h-1.678a.419.419,0,0,0-.419.419V338.1a.419.419,0,0,0,.419.419H338.1a.419.419,0,0,0,.419-.419v-1.678A.419.419,0,0,0,338.1,336m-.419,1.678h-.839v-.839h.839Z"
                  transform="translate(-318.386 -318.549)"
                />
                <path
                  class="a"
                  id="Path_814"
                  data-name="Path 814"
                  d="M274.1,400h-1.678a.419.419,0,0,0-.419.419V402.1a.419.419,0,0,0,.419.419H274.1a.419.419,0,0,0,.419-.419v-1.678A.419.419,0,0,0,274.1,400m-.419,1.678h-.839v-.839h.839Z"
                  transform="translate(-257.741 -379.194)"
                />
                <path
                  class="a"
                  id="Path_815"
                  data-name="Path 815"
                  d="M338.1,400h-1.678a.419.419,0,0,0-.419.419V402.1a.419.419,0,0,0,.419.419H338.1a.419.419,0,0,0,.419-.419v-1.678A.419.419,0,0,0,338.1,400m-.419,1.678h-.839v-.839h.839Z"
                  transform="translate(-318.386 -379.194)"
                />
                <path
                  class="a"
                  id="Path_816"
                  data-name="Path 816"
                  d="M402.1,336h-1.678a.419.419,0,0,0-.419.419v5.033a.419.419,0,0,0,.419.419H402.1a.419.419,0,0,0,.419-.419v-5.033A.419.419,0,0,0,402.1,336m-.419,5.033h-.839v-4.194h.839Z"
                  transform="translate(-379.031 -318.549)"
                />
                <rect
                  class="a"
                  id="Rectangle_1876"
                  data-name="Rectangle 1876"
                  width="2"
                  transform="translate(22 11.998)"
                />
                <rect
                  class="a"
                  id="Rectangle_1877"
                  data-name="Rectangle 1877"
                  transform="translate(21 11.998)"
                />
                <rect
                  class="a"
                  id="Rectangle_1878"
                  data-name="Rectangle 1878"
                  transform="translate(20 11.998)"
                />
              </g>
            </g>
          </svg>
        </div>ค่าใช้จ่าย/วัสดุสิ้นเปลือง
      </template>
      <MenuItem name="expense-sheet" to="/cost-consumables/expense-sheet">ใบบันทึกค่าใช้จ่าย</MenuItem>
      <MenuItem
        name="bill-of-supplies"
        to="/cost-consumables/bill-of-supplies"
      >ใบเบิกวัสดุสิ้นเปลือง</MenuItem>
    </Submenu> -->

    <!-- <MenuItem name="withholding" to="/withholding">
      <div class="wrapper-icon">
        <svg
          xmlns="http://www.w3.org/2000/svg"
          width="22.999"
          height="22.999"
          viewBox="0 0 22.999 22.999"
        >
          <g transform="translate(0 0)">
            <path
              class="a"
              id="Path_824"
              data-name="Path 824"
              d="M82.561,321.241l-.976-.585a1.92,1.92,0,0,0-.985-.272H79.13a3.469,3.469,0,0,0-.891.115l-4.427,1.188a1.544,1.544,0,0,0-1.042.967l-3.894-2.107a1.526,1.526,0,0,0-1.042-.172,1.436,1.436,0,0,0-.388.127,1.507,1.507,0,0,0-.658.613,1.536,1.536,0,0,0-.2.763,1.519,1.519,0,0,0,.758,1.326l6.979,4.176a1.916,1.916,0,0,0,1.009.287h5.4a1.91,1.91,0,0,0,.7-.134l1.125-.444v.578h3.833V320H82.561Zm-1.406,5.579a1.153,1.153,0,0,1-.422.08h-5.4a1.153,1.153,0,0,1-.611-.176l-6.988-4.18a.763.763,0,0,1-.381-.666.779.779,0,0,1,.1-.383.753.753,0,0,1,.329-.3.722.722,0,0,1,.192-.062.808.808,0,0,1,.147-.014.752.752,0,0,1,.376.1l4.222,2.282c0,.023,0,.046.011.07a1.537,1.537,0,0,0,1.482,1.135,3.766,3.766,0,0,0,.632-.113l3.983-1.066-.2-.741-3.97,1.061c-.175.04-.4.086-.447.09a.767.767,0,0,1-.741-.565.7.7,0,0,1-.022-.142s0-.093,0-.125a.775.775,0,0,1,.564-.676l4.425-1.184a2.68,2.68,0,0,1,.693-.091H80.6a1.149,1.149,0,0,1,.591.163l1.37.821v4.129Zm2.173-6.053h2.3V326.9h-2.3Zm0,0"
              transform="translate(-63.395 -304.668)"
            />
            <path
              class="a"
              id="Path_825"
              data-name="Path 825"
              d="M15.81,3.066,13.753,1.01A3.426,3.426,0,0,0,11.314,0H6.495a1.93,1.93,0,0,0-.857.2l-.859.43a1.136,1.136,0,0,1-.556.12L3.833.738V0H0V8.433H3.833V7.283h.652l.232.153a4.226,4.226,0,0,0,2.183.7v4.894H23V3.066ZM3.066,7.666H.767V.766h2.3ZM5.141,6.8l-.426-.282H3.833V1.505l.361.013a1.924,1.924,0,0,0,.927-.2L5.98.888A1.152,1.152,0,0,1,6.495.766h4.819a2.665,2.665,0,0,1,1.9.786l1.514,1.514H11.562l-.93-.93-.542.542L12.8,5.386a.769.769,0,0,1-1.085,1.089L9.452,4.214l-.268.23A2.032,2.032,0,0,1,6.6,4.482L6.377,4.3l-.483.6.225.182a2.794,2.794,0,0,0,.781.44V7.372A3.457,3.457,0,0,1,5.141,6.8Zm5.453-.359.578.579a1.544,1.544,0,0,0,2.166,0,1.94,1.94,0,1,0,.218-.278,1.508,1.508,0,0,0,.126-1.376h5.133A2.306,2.306,0,0,0,20.7,7.251v1.6a2.306,2.306,0,0,0-1.885,1.885h-7.73A2.306,2.306,0,0,0,9.2,8.848v-1.6a2.288,2.288,0,0,0,1.394-.812ZM13.8,8.049a1.15,1.15,0,1,1,1.15,1.15A1.15,1.15,0,0,1,13.8,8.049Zm8.433,4.217H7.666V5.68a2.787,2.787,0,0,0,1.725-.441l.654.654a1.53,1.53,0,0,1-1.229.623H8.433V9.583h.383a1.533,1.533,0,0,1,1.533,1.533V11.5h9.2v-.383a1.533,1.533,0,0,1,1.533-1.533h.383V6.516h-.383a1.533,1.533,0,0,1-1.533-1.533V4.6H13.1l-.767-.767h9.9Zm0,0"
              transform="translate(0 0)"
            />
          </g>
        </svg>
      </div>หัก ณ ที่จ่าย
    </MenuItem> -->

    <Submenu name="master-data">
      <template slot="title">
        <div class="wrapper-icon">
          <svg
            class="no-fill"
            xmlns="http://www.w3.org/2000/svg"
            width="22.51"
            height="22.51"
            viewBox="0 0 22.51 22.51"
          >
            <path
              class="a"
              d="M14.505,14.505A5.253,5.253,0,1,0,9.253,9.253,5.251,5.251,0,0,0,14.505,14.505Zm0,2.626C11,17.131,4,18.891,4,22.384V25.01H25.01V22.384C25.01,18.891,18.011,17.131,14.505,17.131Z"
              transform="translate(-3.25 -3.25)"
            />
          </svg>
        </div>ข้อมูลหลัก
      </template>
      <MenuItem name="customer-profile" to="/master-data/customer-profile">ทะเบียนลูกค้า</MenuItem>
      <!-- <MenuItem name="dealer-profile" to="/master-data/dealer-profile">ทะเบียนผู้จำหน่าย</MenuItem> -->
      <MenuItem name="product-profile" to="/master-data/product-profile">ทะเบียนสินค้า</MenuItem>
      <!-- <MenuItem name="old-product-profile" to="/master-data/old-product-profile">ทะเบียนสินค้าเก่า</MenuItem> -->
      <!-- <MenuItem
        name="supplies-profile"
        to="/master-data/supplies-profile"
      >ทะเบียนวัสดุสิ้นเปลือง / อุปกรณ์สำนักงาน</MenuItem> -->
      <!-- <MenuItem name="set-product-profile" to="/master-data/set-product-profile">ทะเบียนสินค้าชุด</MenuItem> -->
      <!-- <MenuItem name="sale-price-profile" to="/master-data/sale-price-profile">บันทึกราคาขาย</MenuItem> -->
      <!-- <MenuItem
        name="vehicle-inspection-list"
        to="/master-data/vehicle-inspection-list"
      >รายการตรวจสภาพรถ</MenuItem> -->
      <!-- <MenuItem
        name="customer-price-group"
        to="/master-data/customer-price-group"
      >กำหนดราคาต่อกลุ่มลูกค้า</MenuItem> -->
      <MenuItem name="employee-profile" to="/master-data/employee-profile">ทะเบียนพนักงาน</MenuItem>
      <MenuItem name="setting-master-data" to="/master-data/setting-master-data">กำหนดข้อมูลหลัก</MenuItem>
      <!-- <MenuItem name="set-campaign" to="/master-data/set-campaign">กำหนดข้อมูลแคมเปญ</MenuItem> -->
      <!-- <MenuItem name="set-promotion" to="/master-data/set-promotion">กำหนดข้อมูลโปรโมชั่น</MenuItem> -->
      <!-- <MenuItem
        name="set-information-data"
        to="/master-data/set-information-data"
      >กำหนดข้อมูลข่าวสาร</MenuItem> -->
    </Submenu>

    <!-- <MenuItem name="appointment" to="/appointment">
      <div class="wrapper-icon">
        <svg xmlns="http://www.w3.org/2000/svg" width="25.2" height="24" viewBox="0 0 25.2 24">
          <g transform="translate(-5.262 -25.523)">
            <g transform="translate(5.262 25.523)">
              <path
                class="a"
                d="M30.462,28.123a.6.6,0,0,0-.6-.6H27.191a2.6,2.6,0,0,0-5.059,0h-.941a2.6,2.6,0,0,0-5.059,0h-.941a2.6,2.6,0,0,0-5.059,0H9.062a.6.6,0,0,0-.583.459l-3.2,13.2a.6.6,0,0,0,.583.741h2.6v2.2a.6.6,0,0,0,.6.6h10.62a5.4,5.4,0,0,0,10.765-.468c0-.063.015-16.131.015-16.131Zm-1.2,12.626a5.45,5.45,0,0,0-.8-.808V36.123a.6.6,0,1,0-1.2,0V39.2a5.355,5.355,0,0,0-1.369-.408l2.44-10.066h.928ZM9.534,28.723h.6a2.6,2.6,0,0,0,2.529,2,.6.6,0,1,0,0-1.2,1.4,1.4,0,0,1-1.265-.8h4.735a2.6,2.6,0,0,0,2.529,2,.6.6,0,1,0,0-1.2,1.4,1.4,0,0,1-1.265-.8h4.735a2.6,2.6,0,0,0,2.529,2,.6.6,0,1,0,0-1.2,1.4,1.4,0,0,1-1.265-.8h3.7l-.679,2.8H8.855Zm15.128-2a1.4,1.4,0,0,1,1.265.8H23.4a1.4,1.4,0,0,1,1.265-.8Zm-6,0a1.4,1.4,0,0,1,1.265.8H17.4a1.4,1.4,0,0,1,1.265-.8Zm-6,0a1.4,1.4,0,0,1,1.265.8H11.4a1.4,1.4,0,0,1,1.265-.8Zm-4.1,6H26.129l-1.458,6.013a5.394,5.394,0,0,0-3.814,1.986H6.625Zm1.1,9.2H20.118a5.357,5.357,0,0,0-.435,1.6H9.662Zm15.987,6.356v-.556a.6.6,0,0,0-1.2,0v.556a4.208,4.208,0,0,1-3.556-3.556h.556a.6.6,0,0,0,0-1.2h-.556a4.208,4.208,0,0,1,3.556-3.556v.556a.6.6,0,1,0,1.2,0v-.556a4.208,4.208,0,0,1,3.556,3.556h-.556a.6.6,0,0,0,0,1.2h.556a4.208,4.208,0,0,1-3.556,3.556Z"
                transform="translate(-5.262 -25.523)"
              />
              <path
                class="a"
                d="M249.865,190.721h1.6a.6.6,0,1,0,0-1.2h-1.6a.6.6,0,0,0,0,1.2Z"
                transform="translate(-237.065 -181.321)"
              />
              <path
                class="a"
                d="M169.865,190.721h1.6a.6.6,0,1,0,0-1.2h-1.6a.6.6,0,0,0,0,1.2Z"
                transform="translate(-161.065 -181.321)"
              />
              <path
                class="a"
                d="M89.865,190.721h1.6a.6.6,0,1,0,0-1.2h-1.6a.6.6,0,1,0,0,1.2Z"
                transform="translate(-85.065 -181.321)"
              />
              <path
                class="a"
                d="M329.865,190.721h1.6a.6.6,0,1,0,0-1.2h-1.6a.6.6,0,1,0,0,1.2Z"
                transform="translate(-313.065 -181.321)"
              />
              <path
                class="a"
                d="M233.865,238.721h1.6a.6.6,0,1,0,0-1.2h-1.6a.6.6,0,1,0,0,1.2Z"
                transform="translate(-221.865 -226.921)"
              />
              <path
                class="a"
                d="M153.865,238.721h1.6a.6.6,0,0,0,0-1.2h-1.6a.6.6,0,0,0,0,1.2Z"
                transform="translate(-145.865 -226.921)"
              />
              <path
                class="a"
                d="M73.865,238.721h1.6a.6.6,0,1,0,0-1.2h-1.6a.6.6,0,0,0,0,1.2Z"
                transform="translate(-69.865 -226.921)"
              />
              <path
                class="a"
                d="M313.865,238.721h1.6a.6.6,0,1,0,0-1.2h-1.6a.6.6,0,1,0,0,1.2Z"
                transform="translate(-297.865 -226.921)"
              />
              <path
                class="a"
                d="M225.865,286.721h1.6a.6.6,0,0,0,0-1.2h-1.6a.6.6,0,0,0,0,1.2Z"
                transform="translate(-214.265 -272.521)"
              />
              <path
                class="a"
                d="M145.865,286.721h1.6a.6.6,0,0,0,0-1.2h-1.6a.6.6,0,0,0,0,1.2Z"
                transform="translate(-138.265 -272.521)"
              />
              <path
                class="a"
                d="M68.065,286.121a.6.6,0,0,0-.6-.6h-1.6a.6.6,0,0,0,0,1.2h1.6A.6.6,0,0,0,68.065,286.121Z"
                transform="translate(-62.265 -272.521)"
              />
              <path
                class="a"
                d="M360.373,353.7l-1.294,1.294-1.213-.607a.6.6,0,0,0-.537,1.073l1.6.8a.6.6,0,0,0,.693-.112l1.6-1.6a.6.6,0,0,0-.848-.849Z"
                transform="translate(-339.411 -337.122)"
              />
            </g>
          </g>
        </svg>
      </div>ตารางนัดหมาย
    </MenuItem>  -->

    <!-- <Submenu name="crm">
      <template slot="title">
        <div class="wrapper-icon">
          <svg xmlns="http://www.w3.org/2000/svg" width="25" height="25" viewBox="0 0 25 25">
            <g transform="translate(0 0)">
              <path
                class="a"
                d="M5.712,4.613a.366.366,0,1,0-.366-.366A.366.366,0,0,0,5.712,4.613Zm-2.93,0a.366.366,0,1,0-.366-.366A.366.366,0,0,0,2.782,4.613Zm1.465,0a.366.366,0,1,0-.366-.366A.366.366,0,0,0,4.247,4.613Zm-.08,3.88H7.484a.5.5,0,0,0,.255-.932l-.5-.3A4.247,4.247,0,1,0,0,4.247,4.292,4.292,0,0,0,4.166,8.492ZM1.78,1.744A3.489,3.489,0,0,1,4.3.733,3.514,3.514,0,0,1,6.556,6.9a.535.535,0,0,0,.079.863l0,0H4.177a3.514,3.514,0,0,1-2.4-6.016ZM24.634,24.267h-.366V18.814a3.62,3.62,0,0,0-2.155-3.307l-1.93-.827a2.891,2.891,0,0,0,1.239-.779,3.034,3.034,0,0,0,.82-2.059,2.913,2.913,0,0,0-.7-1.895,3.791,3.791,0,0,1-.89-2.439V5.753a5.754,5.754,0,0,0-11.507,0v1.7a3.958,3.958,0,0,1-.951,2.512,2.966,2.966,0,0,0,1.416,4.728l-1.916.833a3.608,3.608,0,0,0-2.213,3.333v4.311a.366.366,0,0,0,.732,0V18.858A2.879,2.879,0,0,1,7.979,16.2l2.4-1.045v2.2h-1.1a1.1,1.1,0,0,0-1.092,1.214l.6,5.695H.366a.366.366,0,0,0,0,.732H24.634a.366.366,0,0,0,0-.732ZM20.979,10.419a2.19,2.19,0,0,1,.529,1.423,2.294,2.294,0,0,1-.62,1.556,2.192,2.192,0,0,1-1.615.687H18.8l-.627-.269a1.671,1.671,0,0,1-1-1.318,3.6,3.6,0,0,0,1.9-3.173V6.572c.107.007.214.011.321.011a4.667,4.667,0,0,0,.526-.03v.954a4.524,4.524,0,0,0,1.062,2.911ZM14.985,16.2a13.567,13.567,0,0,1-3.872-.493v-.872l.106-.046h0l.653-.284a2.4,2.4,0,0,0,1.4-1.72,3.589,3.589,0,0,0,1,.143h1.193a3.589,3.589,0,0,0,1.008-.144,2.4,2.4,0,0,0,1.4,1.707l.7.3h0l.052.022v.824a13.594,13.594,0,0,1-3.646.565Zm3.646.2v.96H11.113v-.893a14.313,14.313,0,0,0,3.633.469l.251,0a14.323,14.323,0,0,0,3.634-.534ZM19.917,5.815a4.067,4.067,0,0,1-2.929-.741.366.366,0,1,0-.449.579,4.425,4.425,0,0,0,1.8.817V8.464a2.679,2.679,0,0,1-.814,1.1,2.808,2.808,0,0,1-.607.382,1.074,1.074,0,0,0-.956-.586H15.1a1.073,1.073,0,0,0,0,2.147h.858A1.075,1.075,0,0,0,17,10.7a6.535,6.535,0,0,0,1.289-.853,2.873,2.873,0,0,1-2.82,2.343H14.276a2.872,2.872,0,0,1-2.869-2.869V6.495a9.82,9.82,0,0,0,3.5-1.253A9.948,9.948,0,0,0,18.232,2a5.018,5.018,0,0,1,1.686,3.815ZM16.3,10.434a.341.341,0,0,1-.341.34H15.1a.341.341,0,0,1,0-.682h.858a.341.341,0,0,1,.341.34ZM9.875,5.753a5.023,5.023,0,0,1,7.773-4.2A9.221,9.221,0,0,1,14.53,4.611,9.106,9.106,0,0,1,11.064,5.8H9.875V5.753ZM8.452,12.8a2.21,2.21,0,0,1,.3-2.372,4.678,4.678,0,0,0,1.12-2.98V6.537h.8V9.325a3.6,3.6,0,0,0,1.9,3.174,1.672,1.672,0,0,1-.993,1.333L11,14.085h-.531A2.21,2.21,0,0,1,8.452,12.8ZM21.2,18.5l-.612,5.772H9.525L8.913,18.5a.366.366,0,0,1,.364-.4H20.836a.366.366,0,0,1,.364.4Zm2.334,5.772h-2.21l.6-5.695a1.1,1.1,0,0,0-1.092-1.214H19.364V15.125l2.456,1.053a2.886,2.886,0,0,1,1.715,2.636Zm-8.478-4.48a1.392,1.392,0,1,0,1.392,1.392A1.393,1.393,0,0,0,15.057,19.787Zm0,2.051a.659.659,0,1,1,.659-.659A.66.66,0,0,1,15.057,21.838Z"
                transform="translate(0 0)"
              />
            </g>
          </svg>
        </div>ลูกค้าสัมพันธ์/พิเศษ
      </template>
      <MenuItem name="customer-relations" to="/crm/customer-relations">ลูกค้าสัมพันธ์</MenuItem>
      <MenuItem
        name="satisfaction-survey-form"
        to="/crm/satisfaction-survey-form"
      >แบบประเมินความพึงพอใจลูกค้า</MenuItem>
      <MenuItem name="follow-up-result" to="/crm/follow-up-result">ติดตามผลการให้บริการ</MenuItem>
    </Submenu> -->

    <!-- <Submenu name="receive-pay-cash-end-day">
      <template slot="title">
        <div class="wrapper-icon">
          <svg
            xmlns="http://www.w3.org/2000/svg"
            width="23.272"
            height="22.999"
            viewBox="0 0 23.272 22.999"
          >
            <g transform="translate(0 -3)">
              <g id="Group_1457" data-name="Group 1457" transform="translate(13.634 14.509)">
                <g id="Group_1456" data-name="Group 1456">
                  <path
                    class="a"
                    id="Path_818"
                    data-name="Path 818"
                    d="M301.863,259.481a.875.875,0,1,1,1-.865.455.455,0,0,0,.909,0,1.808,1.808,0,0,0-1.454-1.723v-.236a.455.455,0,1,0-.909,0v.236a1.808,1.808,0,0,0-1.454,1.723,1.848,1.848,0,0,0,1.909,1.775.875.875,0,1,1-1,.866.455.455,0,1,0-.909,0,1.808,1.808,0,0,0,1.454,1.723v.2a.455.455,0,0,0,.909,0v-.2a1.808,1.808,0,0,0,1.454-1.723A1.848,1.848,0,0,0,301.863,259.481Z"
                    transform="translate(-299.954 -256.201)"
                  />
                </g>
              </g>
              <g id="Group_1459" data-name="Group 1459" transform="translate(17.45 12.899)">
                <g id="Group_1458" data-name="Group 1458">
                  <path
                    class="a"
                    id="Path_819"
                    data-name="Path 819"
                    d="M386.995,222.971a5.923,5.923,0,0,0-2.419-2.141.455.455,0,1,0-.394.819,5,5,0,0,1,2.254,6.854.455.455,0,1,0,.8.427,5.916,5.916,0,0,0-.243-5.959Z"
                    transform="translate(-383.924 -220.785)"
                  />
                </g>
              </g>
              <g id="Group_1461" data-name="Group 1461" transform="translate(15.772 12.363)">
                <g id="Group_1460" data-name="Group 1460">
                  <path
                    class="a"
                    id="Path_820"
                    data-name="Path 820"
                    d="M347.485,209h-.031a.455.455,0,0,0,0,.909h.029a.455.455,0,0,0,0-.909Z"
                    transform="translate(-347 -209.001)"
                  />
                </g>
              </g>
              <g id="Group_1463" data-name="Group 1463" transform="translate(9.636 15.259)">
                <g id="Group_1462" data-name="Group 1462">
                  <path
                    class="a"
                    id="Path_821"
                    data-name="Path 821"
                    d="M215.748,280.233a5,5,0,0,1-2.254-6.854.455.455,0,1,0-.8-.427,5.911,5.911,0,0,0,2.662,8.1.455.455,0,1,0,.394-.819Z"
                    transform="translate(-212.002 -272.711)"
                  />
                </g>
              </g>
              <g id="Group_1465" data-name="Group 1465" transform="translate(14.38 23.272)">
                <g id="Group_1464" data-name="Group 1464">
                  <path
                    class="a"
                    id="Path_822"
                    data-name="Path 822"
                    d="M316.861,449h-.026a.455.455,0,0,0,0,.909h.03a.455.455,0,1,0,0-.909Z"
                    transform="translate(-316.378 -448.999)"
                  />
                </g>
              </g>
              <g id="Group_1467" data-name="Group 1467" transform="translate(0 3)">
                <g id="Group_1466" data-name="Group 1466" transform="translate(0 0)">
                  <path
                    class="a"
                    id="Path_823"
                    data-name="Path 823"
                    d="M17.609,10.825a2.086,2.086,0,0,0-.2-.371H18.59a2.091,2.091,0,0,0,0-4.182H14.95A2.089,2.089,0,0,0,13.227,3H2.091a2.091,2.091,0,1,0,0,4.182h3.64a2.085,2.085,0,0,0,0,2.364H4.545a2.09,2.09,0,0,0-1.3,3.727,2.087,2.087,0,0,0,0,3.273,2.087,2.087,0,0,0,0,3.273,2.09,2.09,0,0,0,1.3,3.727H9.9a7.725,7.725,0,1,0,7.707-12.719Zm.981-3.644a1.182,1.182,0,0,1,0,2.364H7.454a1.182,1.182,0,0,1,0-2.364Zm-16.5-.909a1.182,1.182,0,1,1,0-2.364H13.227a1.182,1.182,0,1,1,0,2.364Zm2.454,4.182H15.681a1.181,1.181,0,0,1,.516.119c-.215-.018-.432-.028-.652-.028a7.7,7.7,0,0,0-5.468,2.273H4.545a1.182,1.182,0,1,1,0-2.364Zm0,3.273H9.3A7.7,7.7,0,0,0,8.132,16.09H4.545a1.182,1.182,0,0,1,0-2.364Zm0,3.273H7.923A7.733,7.733,0,0,0,7.9,19.363H4.545a1.182,1.182,0,1,1,0-2.364Zm0,5.636a1.182,1.182,0,0,1,0-2.364H8.081a7.7,7.7,0,0,0,1.091,2.364Zm11,2.454a6.818,6.818,0,1,1,6.818-6.818A6.826,6.826,0,0,1,15.545,25.09Z"
                    transform="translate(0 -3)"
                  />
                </g>
              </g>
            </g>
          </svg>
        </div>รับจ่ายเงินสด/ปิดสิ้นวัน
      </template>
      <MenuItem
        name="receive-pay-cash"
        to="/receive-pay-cash-end-day/receive-pay-cash"
      >บันทึกรับ-จ่ายเงินสด</MenuItem>
      <MenuItem name="close-end-of-day" to="/receive-pay-cash-end-day/close-end-of-day">ปิดสิ้นวัน</MenuItem>
    </Submenu> -->

    <!-- <Submenu name="payable-management" to="/payable-management">
      <template slot="title">
        <div class="wrapper-icon">
          <svg
            xmlns="http://www.w3.org/2000/svg"
            width="23.432"
            height="24.625"
            viewBox="0 0 23.432 24.625"
          >
            <g transform="translate(-0.105 0)">
              <path
                class="a"
                d="M136.1,168h.822v.822H136.1Zm0,0"
                transform="translate(-129.011 -159.367)"
              />
              <path
                class="a"
                d="M17.083,12.7a1.3,1.3,0,0,0,.288-.781V5.344a1.211,1.211,0,0,0-1.233-1.233h-.617l1.028-2.384v-.9A.825.825,0,0,0,15.727,0H11.616a.825.825,0,0,0-.822.822v.9l1.028,2.384h-.288a1.12,1.12,0,0,0-.863.37L9.4,5.755H.105v.822H5.45v4.111H.105v.822H10.218l.206.164-1.85,1.85a6.5,6.5,0,0,0,4.6,11.1H13.3a6.457,6.457,0,0,0,6.536-6.454,6.643,6.643,0,0,0-1.891-4.6ZM11.616.822h4.111v.74l-1.11,2.549H12.685L11.616,1.562ZM6.272,6.577h.822V7.811h.822V6.577H9.149v4.111H6.272Zm3.7,4.111V6.331l1.274-1.274a.374.374,0,0,1,.288-.123h.9a.388.388,0,0,1,.411.411V6.988a.411.411,0,1,1-.822,0V6.166H11.2v.822a1.233,1.233,0,0,0,2.467,0V5.344a1.459,1.459,0,0,0-.082-.411h2.549a.388.388,0,0,1,.411.411v.822H14.494v.822h2.055V8.222H14.494v.822h2.055v1.233H14.494V11.1h2.055v.822a.388.388,0,0,1-.411.411H12.6l-2.055-1.644Zm3.371,13.155h-.123a5.669,5.669,0,0,1-4.029-9.7l1.932-1.932,1.192.945h3.823a.308.308,0,0,0,.206-.041l.987.987a5.715,5.715,0,0,1-3.988,9.743Zm0,0"
              />
              <path
                class="a"
                d="M182.84,276.317,179.3,278.66l.493.658,3.864-2.59V272h-.822Zm0,0"
                transform="translate(-169.99 -258.023)"
              />
              <path
                class="a"
                d="M424.1,256h.822v.822H424.1Zm0,0"
                transform="translate(-402.212 -242.845)"
              />
              <path
                class="a"
                d="M408.105,272h.822v.822h-.822Zm0,0"
                transform="translate(-387.034 -258.023)"
              />
              <path
                class="a"
                d="M424.1,288h.822v.822H424.1Zm0,0"
                transform="translate(-402.212 -273.201)"
              />
              <path
                class="a"
                d="M440.105,272h.822v.822h-.822Zm0,0"
                transform="translate(-417.39 -258.023)"
              />
              <path
                class="a"
                d="M56.105,424h.822v.822h-.822Zm0,0"
                transform="translate(-53.122 -402.212)"
              />
              <path
                class="a"
                d="M40.105,440h.822v.822h-.822Zm0,0"
                transform="translate(-37.945 -417.39)"
              />
              <path
                class="a"
                d="M56.105,456h.822v.822h-.822Zm0,0"
                transform="translate(-53.122 -432.568)"
              />
              <path
                class="a"
                d="M72.105,440h.822v.822h-.822Zm0,0"
                transform="translate(-68.3 -417.39)"
              />
              <path
                class="a"
                d="M392.105,120h.822v.822h-.822Zm0,0"
                transform="translate(-371.856 -113.834)"
              />
              <path
                class="a"
                d="M376.105,136h.822v.822h-.822Zm0,0"
                transform="translate(-356.678 -129.012)"
              />
              <path
                class="a"
                d="M392.105,152h.822v.822h-.822Zm0,0"
                transform="translate(-371.856 -144.189)"
              />
              <path
                class="a"
                d="M408.105,136h.822v.822h-.822Zm0,0"
                transform="translate(-387.034 -129.012)"
              />
              <path
                class="a"
                d="M72.105,296h.822v.822h-.822Zm0,0"
                transform="translate(-68.3 -280.79)"
              />
              <path
                class="a"
                d="M56.105,312h.822v.822h-.822Zm0,0"
                transform="translate(-53.122 -295.968)"
              />
              <path
                class="a"
                d="M72.105,328h.822v.822h-.822Zm0,0"
                transform="translate(-68.3 -311.145)"
              />
              <path
                class="a"
                d="M88.105,312h.822v.822h-.822Zm0,0"
                transform="translate(-83.478 -295.968)"
              />
            </g>
          </svg>
        </div>การจัดการเจ้าหนี้
      </template>
      <MenuItem name="income-and-expense">บันทึกรับ-จ่ายเงินสด</MenuItem>
      <MenuItem name="reimbursement-slip" to="/payable-management/reimbursement-slip">ใบชำระเจ้าหนี้</MenuItem>
      <MenuItem name="debt-repayment" to="/payable-management/debt-repayment">ใบเจ้าหนี้คืนชำระ</MenuItem>
      <MenuItem name="creditor-note" to="/payable-management/creditor-note">ใบลดหนี้เจ้าหนี้</MenuItem>
      <MenuItem
        name="creditor-entry"
        to="/payable-management/creditor-entry"
      >ใบลดหนี้เจ้าหนี้(ตามใบรับเข้า)</MenuItem>
      <MenuItem
        name="purchase-debit-note"
        to="/payable-management/purchase-debit-note"
      >ใบเพิ่มหนี้เจ้าหนี้</MenuItem>
      <MenuItem
        name="purchase-debit-entry"
        to="/payable-management/purchase-debit-entry"
      >ใบเพิ่มหนี้เจ้าหนี้(ตามใบรับเข้า)</MenuItem>
    </Submenu> -->

    <!-- <Submenu name="receivable-management" to="/receivable-management">
      <template slot="title">
        <div class="wrapper-icon">
          <svg
            xmlns="http://www.w3.org/2000/svg"
            xmlns:xlink="http://www.w3.org/1999/xlink"
            width="23"
            height="23"
            viewBox="0 0 23 23"
          >
            <defs>
              <clipPath id="clip-path">
                <rect
                  class="a"
                  id="Rectangle_1880"
                  data-name="Rectangle 1880"
                  width="23"
                  height="23"
                  transform="translate(0 -0.001)"
                />
              </clipPath>
            </defs>
            <g id="Group_1468" data-name="Group 1468" transform="translate(0 0.247)">
              <g
                id="Group_1462"
                data-name="Group 1462"
                transform="translate(0 -0.247)"
                clip-path="url(#clip-path)"
              >
                <path
                  class="a"
                  id="Path_817"
                  data-name="Path 817"
                  d="M22.766,16.743a6.025,6.025,0,1,0-9.8,4.694H10.712v-2a.667.667,0,0,0-.667-.667H7.634l.224-4.046h.258a.666.666,0,0,0,.667-.638l.334-7.008A2.89,2.89,0,0,0,6.843,4.113a2.69,2.69,0,1,0-4.566,0A2.89,2.89,0,0,0,0,7.076l.333,7.008A.667.667,0,0,0,1,14.719h.258l.409,7.373a.667.667,0,0,0,.666.63H6.784a.666.666,0,0,0,.666-.63L7.56,20.1H9.386v2a.666.666,0,0,0,.667.667h6.722a6.032,6.032,0,0,0,6-6.024ZM4.56,1.336A1.357,1.357,0,1,1,3.2,2.692,1.357,1.357,0,0,1,4.56,1.336m1.6,20.054H2.968l-.409-7.373a.667.667,0,0,0-.666-.63H1.64l-.3-6.374A1.556,1.556,0,0,1,2.814,5.384l.076,0h3.34A1.556,1.556,0,0,1,7.787,6.937q0,.038,0,.076l-.3,6.374H7.227a.667.667,0,0,0-.666.63L6.3,18.767H4.713a.667.667,0,1,0,0,1.334H6.224Zm10.588.044a4.694,4.694,0,1,1,4.694-4.694,4.694,4.694,0,0,1-4.694,4.694h0Z"
                  transform="translate(0 0.227)"
                />
                <path
                  class="a"
                  id="Path_818"
                  data-name="Path 818"
                  d="M177.407,159.79v.492a1.258,1.258,0,0,0,.419,2.444.419.419,0,1,1,0,.839.759.759,0,0,1-.545-.317.419.419,0,1,0-.642.54,1.74,1.74,0,0,0,.767.546v.49a.419.419,0,0,0,.839,0v-.491a1.258,1.258,0,0,0-.419-2.444.419.419,0,0,1,0-.839.674.674,0,0,1,.454.219.419.419,0,1,0,.583-.6,1.621,1.621,0,0,0-.618-.386v-.489a.419.419,0,1,0-.839,0"
                  transform="translate(-161.19 -145.284)"
                />
              </g>
            </g>
          </svg>
        </div>การจัดการลูกหนี้
      </template>
      <MenuItem name="receivable-slip" to="/receivable-management/receivable-slip">ใบชำระลูกหนี้</MenuItem>
      <MenuItem name="repayment-slip" to="/receivable-management/repayment-slip">ใบคืนชำระลูกหนี้</MenuItem>
      <MenuItem name="credit-note" to="/receivable-management/credit-note">ใบลดหนี้ลูกหนี้</MenuItem>
      <MenuItem
        name="credit-note-receipt"
        to="/receivable-management/credit-note-receipt"
      >ใบลดหนี้ลูกหนี้(ตามใบเสร็จ)</MenuItem>
      <MenuItem name="debit-note" to="/receivable-management/debit-note">ใบเพิ่มหนี้ลูกหนี้</MenuItem>
      <MenuItem
        name="debit-note-receipt"
        to="/receivable-management/debit-note-receipt"
      >ใบเพิ่มหนี้ลูกหนี้(ตามใบเสร็จ)</MenuItem>
      <MenuItem name="bill" to="/receivable-management/bill">ใบแจ้งหนี้</MenuItem>
    </Submenu> -->

    <!-- <Submenu name="cheque" to="/cheque">
      <template slot="title">
        <div class="wrapper-icon">
          <svg
            xmlns="http://www.w3.org/2000/svg"
            width="23.978"
            height="17.125"
            viewBox="0 0 23.978 17.125"
          >
            <g transform="translate(0 -72.916)">
              <path
                class="a"
                d="M34.794,309.947h9.512a.352.352,0,1,0,0-.7H34.794a.352.352,0,0,0,0,.7Z"
                transform="translate(-32.824 -225.221)"
              />
              <path
                class="a"
                d="M197.3,344.965c.087.3.178.611.488.611.168,0,.282,0,1.615-1.556a2.9,2.9,0,0,0,1.775,1.117.971.971,0,0,0,.11-.006,2.022,2.022,0,0,0,1.011-.553c.523-.435.617-.43.824-.217a1.665,1.665,0,0,0,2.108.272.352.352,0,1,0-.382-.593.96.96,0,0,1-1.221-.17.971.971,0,0,0-1.03-.311,2.306,2.306,0,0,0-.751.477,1.544,1.544,0,0,1-.641.394c-.392.045-1.139-.673-1.52-1.172a.352.352,0,0,0-.549-.014c-.414.488-.893,1.033-1.205,1.367-.116-.434-.273-1.129-.4-1.742a.352.352,0,0,0-.676-.051l-.865,2.35a.352.352,0,1,0,.662.243l.448-1.217C197.181,344.517,197.247,344.776,197.3,344.965Z"
                transform="translate(-186.765 -256.999)"
              />
              <path
                class="a"
                d="M34.794,276.209h9.512a.352.352,0,1,0,0-.7H34.794a.352.352,0,0,0,0,.7Z"
                transform="translate(-32.824 -193.068)"
              />
              <path
                class="a"
                d="M35.331,200.216H47.5a.889.889,0,0,0,.888-.888V198.3a.889.889,0,0,0-.888-.888H35.331a.889.889,0,0,0-.888.888v1.027A.889.889,0,0,0,35.331,200.216Zm-.183-1.916a.184.184,0,0,1,.183-.183H47.5a.184.184,0,0,1,.183.183v1.027a.184.184,0,0,1-.183.183H35.331a.184.184,0,0,1-.183-.183V198.3Z"
                transform="translate(-32.824 -118.646)"
              />
              <path
                class="a"
                d="M225.673,389.135a.352.352,0,0,0-.352.352v.835a.374.374,0,0,1-.374.374H214.482a.352.352,0,1,0,0,.7h10.465a1.08,1.08,0,0,0,1.078-1.078v-.835A.352.352,0,0,0,225.673,389.135Z"
                transform="translate(-204.068 -301.359)"
              />
              <path
                class="a"
                d="M23.731,75.525A1.739,1.739,0,0,0,22.8,74.8l.121-.456a1.028,1.028,0,0,0-.127-.817,1.13,1.13,0,0,0-.672-.491l-.3-.081a1.086,1.086,0,0,0-1.343.738l-.994,3.736H1.078A1.079,1.079,0,0,0,0,78.508V88.963a1.079,1.079,0,0,0,1.078,1.078H8.817a.352.352,0,1,0,0-.7H1.078A.374.374,0,0,1,.7,88.963V78.508a.374.374,0,0,1,.373-.374H19.295l-.25.941v.005L18.321,81.8v0L18,83a1.073,1.073,0,0,0,.57,1.22l-.253.95a.352.352,0,1,0,.681.181l.248-.933a1.149,1.149,0,0,0,.155.011,1.116,1.116,0,0,0,.528-.132,1.028,1.028,0,0,0,.517-.646l.32-1.2h0l.486-1.827V86.53a.352.352,0,1,0,.7,0V78.508a1.072,1.072,0,0,0-.053-.335l.715-2.689a1.032,1.032,0,0,1,.513.415.87.87,0,0,1,.112.69l-.581,2.183a.352.352,0,1,0,.681.181l.581-2.183a1.569,1.569,0,0,0-.2-1.245Zm-3.965,7.947a.33.33,0,0,1-.168.206.427.427,0,0,1-.313.033l-.3-.081a.382.382,0,0,1-.3-.446l.23-.863L20,82.61Zm.411-1.544-1.084-.288.543-2.041,1.084.288Zm.724-2.722-1.084-.288,1.341-5.043a.364.364,0,0,1,.364-.254c.038,0,.421.1.421.1a.428.428,0,0,1,.255.184.33.33,0,0,1,.044.262Z"
              />
            </g>
          </svg>
        </div>เช็คธนาคาร
      </template>
      <MenuItem name="accepting-cheque" to="/cheque/accepting-cheque">บันทึกการรับเช็ค</MenuItem>
      <MenuItem name="payment-cheque" to="/cheque/payment-cheque">บันทึกการจ่ายเช็ค</MenuItem>
      <MenuItem name="search-bank-account" to="/cheque/search-bank-account">ค้นหาข้อมูลบัญชีธนาคาร</MenuItem>
      <MenuItem
        name="bank-account-information"
        to="/cheque/bank-account-information"
      >ข้อมูลบัญชีธนาคาร</MenuItem>
    </Submenu> -->

    <Submenu name="report" to="/report">
      <template slot="title">
        <div class="wrapper-icon">
          <svg
            xmlns="http://www.w3.org/2000/svg"
            width="24"
            height="24.004"
            viewBox="0 0 24 24.004"
          >
            <g transform="translate(-2.009 -2)">
              <path
                class="a"
                d="M25.893,6.517l-4.4-4.4A.413.413,0,0,0,21.209,2h-10a1.2,1.2,0,0,0-1.2,1.2v2.42a8.391,8.391,0,0,0,0,16.763V24.8a1.2,1.2,0,0,0,1.2,1.2h13.6a1.2,1.2,0,0,0,1.2-1.2V6.8A.413.413,0,0,0,25.893,6.517ZM21.609,3.364,24.645,6.4H22.009a.4.4,0,0,1-.4-.4ZM2.805,14a7.61,7.61,0,0,1,7.2-7.589v7.425L4.766,19.079A7.553,7.553,0,0,1,2.805,14ZM5.33,19.643,10.571,14.4H18A7.586,7.586,0,0,1,5.33,19.643ZM25.209,24.8a.4.4,0,0,1-.4.4h-13.6a.4.4,0,0,1-.4-.4v-2.42a8.407,8.407,0,0,0,8-8.381.4.4,0,0,0-.4-.4h-7.6V3.2a.4.4,0,0,1,.4-.4h9.6V6a1.2,1.2,0,0,0,1.2,1.2h3.2Z"
              />
              <path
                class="a"
                d="M26.4,7a.4.4,0,0,0-.4.4v8a.4.4,0,0,0,.4.4h8a.4.4,0,0,0,.4-.4A8.411,8.411,0,0,0,26.4,7Zm.4,8V7.812A7.608,7.608,0,0,1,33.989,15Z"
                transform="translate(-14.393 -3)"
              />
              <path
                class="a"
                d="M43.6,40a3.6,3.6,0,1,0,3.6,3.6A3.6,3.6,0,0,0,43.6,40Zm0,6.4a2.8,2.8,0,1,1,2.8-2.8A2.8,2.8,0,0,1,43.6,46.4Z"
                transform="translate(-22.792 -22.797)"
              />
              <path
                class="a"
                d="M44.776,47.411l-.917-.917-.566.566,1.2,1.2a.4.4,0,0,0,.566,0l2.4-2.4-.566-.566Z"
                transform="translate(-24.768 -25.973)"
              />
              <path class="a" d="M50,19h3.2v.8H50Z" transform="translate(-28.791 -10.199)" />
              <path class="a" d="M50,25h3.2v.8H50Z" transform="translate(-28.791 -13.798)" />
              <path class="a" d="M50,31h3.2v.8H50Z" transform="translate(-28.791 -17.398)" />
            </g>
          </svg>
        </div>รายงาน
      </template>
      <Submenu name="1">
        <template slot="title">รายงานการขาย</template>
        <MenuItem name="1-1">รายงานใบสั่งซ่อม</MenuItem>
        <!-- <MenuItem name="1-2">รายงานใบเสนอราคา</MenuItem> -->
        <!-- <MenuItem name="1-3">รายงานใบรับมัดจำ</MenuItem> -->
        <MenuItem name="1-4">รายงานสรุปการขายประจำวัน</MenuItem>
        <!-- <MenuItem name="1-5">รายงานสรุปการรับชำระประจำวัน</MenuItem> -->
        <!-- <MenuItem name="1-6">รายงานสรุปยอดบัตรเครดิต</MenuItem> -->
        <!-- <MenuItem name="1-7">รายงานสรุปยอดขาย</MenuItem> -->
        <!-- <MenuItem name="1-8">รายงานสรุปการใช้โปรโมชั่น</MenuItem> -->
        <!-- <MenuItem name="1-9">รายงานประวัติการใช้บริการ</MenuItem> -->
        <!-- <MenuItem name="1-10">รายงานใบกำกับภาษีเต็มรูป</MenuItem> -->
        <!-- <MenuItem name="1-11">รายงาน E-journal</MenuItem> -->
      </Submenu>
      <!-- <Submenu name="2">
        <template slot="title">รายงานการซื้อ</template>
        <MenuItem name="2-1">รายงานใบขอซื้อสินค้า</MenuItem>
        <MenuItem name="2-2">รายงานสินค้าค้างรับ</MenuItem>
      </Submenu>
      <Submenu name="3">
        <template slot="title">รายงานคลังสินค้า</template>
        <MenuItem name="3-1">รายงานสินค้าคงคลัง</MenuItem>
        <MenuItem name="3-2">รายงานความเคลื่อนไหวของสินค้า</MenuItem>
        <MenuItem name="3-3">รายงาน ROP/EOQ</MenuItem>
        <MenuItem name="3-4">รายงานการรับเข้าสินค้า</MenuItem>
        <MenuItem name="3-5">รายงาน DOT ยาง</MenuItem>
      </Submenu>
      <Submenu name="4">
        <template slot="title">รายงานข้อมูลหลัก</template>
        <MenuItem name="4-1">รายงาน Customer Price Group</MenuItem>
        <MenuItem name="4-2">รายงานทะเบียนรถยนต์</MenuItem>
        <MenuItem name="4-3">รายงานทะเบียนสินค้า</MenuItem>
        <MenuItem name="4-4">รายงานทะเบียนลูกค้า</MenuItem>
        <MenuItem name="4-5">รายงานทะเบียนผู้จำหน่าย</MenuItem>
      </Submenu>
      <Submenu name="5">
        <template slot="title">รายงานเจ้าหนี้</template>
        <MenuItem name="5-1">รายงานเพิ่มหนี้เจ้าหนี้</MenuItem>
        <MenuItem name="5-2">รายงานเพิ่มหนี้เจ้าหนี้ตามเข้า</MenuItem>
        <MenuItem name="5-3">รายงานลดหนี้เจ้าหนี้</MenuItem>
        <MenuItem name="5-4">รายงานลดหนี้เจ้าหนี้ตามใบรับเข้า</MenuItem>
        <MenuItem name="5-5">รายงานเจ้าหนี้ค้างชำระ</MenuItem>
        <MenuItem name="5-6">รายงานการจ่ายชำระเจ้าหนี้</MenuItem>
        <MenuItem name="5-7">รายงานสรุปการจ่ายชำระประจำวัน</MenuItem>
        <MenuItem name="5-8">รายงานอายุเจ้าหนี้</MenuItem>
      </Submenu>
      <Submenu name="6">
        <template slot="title">รายงานลูกหนี้</template>
        <MenuItem name="6-1">รายงานการวางบิล/รับชำระลูกหนี้</MenuItem>
        <MenuItem name="6-2">รายงานเพิ่มหนี้ลูกหนี้ตามใบเสร็จ</MenuItem>
        <MenuItem name="6-3">รายงานลดหนี้ลูกหนี้</MenuItem>
        <MenuItem name="6-4">รายงานลดหนี้ลูกหนี้ตามใบเสร็จ</MenuItem>
        <MenuItem name="6-5">รายงานลูกหนี้ค้างชำระ</MenuItem>
        <MenuItem name="6-6">รายงานอายุลูกหนี้</MenuItem>
      </Submenu>
      <Submenu name="7">
        <template slot="title">รายงานภาษี</template>
        <MenuItem name="7-1">รายงานภาษีซื้อ</MenuItem>
        <MenuItem name="7-2">รายงานภาษีขาย</MenuItem>
      </Submenu>
      <Submenu name="8">
        <template slot="title">รายงานการรับ-จ่ายเงิน</template>
        <MenuItem name="8-1">รายงานรับเงินประจำวัน</MenuItem>
        <MenuItem name="8-2">รายงานจ่ายเงินประจำวัน</MenuItem>
      </Submenu>
      <Submenu name="9">
        <template slot="title">รายงานลูกค้าสัมพันธ์</template>
        <MenuItem name="9-1">รายงานบริการครั้งถัดไปของลูกค้า</MenuItem>
        <MenuItem name="9-2">รายงานลูกค้าที่ขาดการติดต่อ</MenuItem>
        <MenuItem name="9-3">รายงานวันเกิดลูกค้า</MenuItem>
        <MenuItem name="9-4">รายงาน VAT Balance</MenuItem>
        <MenuItem name="9-5">รายงานความเคลื่อนไหว VAT BALANCE</MenuItem>
        <MenuItem name="9-6">รายงานสรุปการซื้อขาย-รับจ่ายประจำวัน</MenuItem>
      </Submenu>
      <Submenu name="10">
        <template slot="title">รายงานบันทึกการใช้งานระบบ</template>
        <MenuItem name="10-1">รายงานบันทึกการจัดการเอกสาร</MenuItem>
      </Submenu> -->
    </Submenu>

    <Submenu name="system-management" to="/system-management">
      <template slot="title">
        <div class="wrapper-icon">
          <svg
            xmlns="http://www.w3.org/2000/svg"
            width="24.012"
            height="24.013"
            viewBox="0 0 24.012 24.013"
          >
            <g transform="translate(-0.012)">
              <g transform="translate(0.012 0)">
                <g transform="translate(0 0)">
                  <path
                    class="a"
                    d="M262.55,265.3a2.74,2.74,0,1,0-1.938-.8A2.733,2.733,0,0,0,262.55,265.3Zm-1.441-4.181a2.038,2.038,0,1,1,0,2.882A2.031,2.031,0,0,1,261.109,261.12Z"
                    transform="translate(-247.631 -247.641)"
                  />
                  <path
                    class="a"
                    d="M223.234,223.367a4.5,4.5,0,0,0-.963,4.956.352.352,0,1,0,.647-.275,3.811,3.811,0,1,1,3.53,2.319h-.023a3.786,3.786,0,0,1-2.659-1.082.352.352,0,1,0-.491.5,4.484,4.484,0,0,0,3.15,1.282h.027a4.513,4.513,0,1,0-3.218-7.7Z"
                    transform="translate(-211.507 -211.638)"
                  />
                  <path
                    class="a"
                    d="M23.35,13.341H22.1a7.278,7.278,0,0,0-.983-2.375L22,10.083a.673.673,0,0,0,0-.952L20.72,7.85a.673.673,0,0,0-.952,0l-.884.884a7.277,7.277,0,0,0-2.375-.983V6.5a.674.674,0,0,0-.673-.673h-1.81a.672.672,0,0,0-.52.246h-.23a5.946,5.946,0,0,0-.762-1.842l.676-.676a.612.612,0,0,0,0-.865L12.155,1.655a.612.612,0,0,0-.865,0l-.676.676a5.946,5.946,0,0,0-1.842-.762V.612A.612.612,0,0,0,8.16,0H6.7a.612.612,0,0,0-.612.612v.957a5.948,5.948,0,0,0-1.842.762l-.676-.676a.612.612,0,0,0-.865,0L1.667,2.69a.612.612,0,0,0,0,.865l.676.676a5.947,5.947,0,0,0-.762,1.842H.624a.612.612,0,0,0-.612.612V8.148a.612.612,0,0,0,.612.612h.957A5.946,5.946,0,0,0,2.343,10.6l-.676.676a.612.612,0,0,0,0,.865L2.7,13.178a.612.612,0,0,0,.865,0l.676-.676a5.945,5.945,0,0,0,1.842.762v.23a.672.672,0,0,0-.247.521v1.811a.674.674,0,0,0,.673.673H7.762a7.279,7.279,0,0,0,.983,2.375l-.884.884a.673.673,0,0,0,0,.952l1.28,1.28a.673.673,0,0,0,.952,0l.884-.884a7.277,7.277,0,0,0,2.375.983V23.34a.674.674,0,0,0,.673.673h1.81a.674.674,0,0,0,.673-.673V22.089a7.277,7.277,0,0,0,2.375-.983l.884.884a.673.673,0,0,0,.952,0L22,20.71a.673.673,0,0,0,0-.952l-.884-.884A7.279,7.279,0,0,0,22.1,16.5H23.35a.674.674,0,0,0,.673-.673V14.015a.674.674,0,0,0-.673-.673ZM6.3,12.592a5.248,5.248,0,0,1-1.742-.721.616.616,0,0,0-.765.081l-.664.664-.905-.905.664-.664a.616.616,0,0,0,.081-.765A5.248,5.248,0,0,1,2.252,8.54a.616.616,0,0,0-.6-.484H.715V6.776h.939a.616.616,0,0,0,.6-.484A5.248,5.248,0,0,1,2.973,4.55a.616.616,0,0,0-.081-.765l-.664-.664.905-.905L3.8,2.88a.616.616,0,0,0,.765.081A5.248,5.248,0,0,1,6.3,2.24a.616.616,0,0,0,.484-.6V.7h1.28v.939a.616.616,0,0,0,.484.6,5.249,5.249,0,0,1,1.742.721.616.616,0,0,0,.765-.081l.664-.664.905.905-.664.664a.615.615,0,0,0-.081.765A5.248,5.248,0,0,1,12.6,6.292a.616.616,0,0,0,.6.484h.15v.975a7.277,7.277,0,0,0-2.375.983l-.884-.884-.033-.03a2.664,2.664,0,0,0-3.567-2.9.352.352,0,0,0,.246.659A1.96,1.96,0,0,1,9.367,7.7a.672.672,0,0,0-.226.149L7.861,9.13a.671.671,0,0,0-.149.226,1.969,1.969,0,0,1-.284.021A1.962,1.962,0,0,1,5.717,6.457.352.352,0,1,0,5.1,6.113,2.663,2.663,0,0,0,7.83,10.049c.01.011.02.023.031.034l.884.884a7.278,7.278,0,0,0-.983,2.375H6.788V13.19a.616.616,0,0,0-.484-.6Zm17.016,3.2H22.075a.678.678,0,0,0-.658.533,6.577,6.577,0,0,1-.9,2.183.678.678,0,0,0,.089.842l.88.88-1.238,1.238-.88-.88a.678.678,0,0,0-.842-.089,6.578,6.578,0,0,1-2.183.9.678.678,0,0,0-.533.658V23.31H14.055V22.064a.678.678,0,0,0-.533-.658,6.577,6.577,0,0,1-2.183-.9.678.678,0,0,0-.842.089l-.88.88L8.38,20.233l.88-.88a.678.678,0,0,0,.089-.842,6.578,6.578,0,0,1-.9-2.183.678.678,0,0,0-.658-.533H6.541V14.044H7.787a.678.678,0,0,0,.658-.533,6.577,6.577,0,0,1,.9-2.183.678.678,0,0,0-.089-.842l-.88-.88L9.618,8.368l.88.88a.678.678,0,0,0,.842.089,6.578,6.578,0,0,1,2.183-.9.678.678,0,0,0,.533-.658V6.53h1.751V7.776a.678.678,0,0,0,.533.658,6.577,6.577,0,0,1,2.183.9.678.678,0,0,0,.842-.089l.88-.88,1.238,1.238-.88.88a.678.678,0,0,0-.089.842,6.578,6.578,0,0,1,.9,2.183.678.678,0,0,0,.658.533h1.246V15.8Z"
                    transform="translate(-0.012 0)"
                  />
                </g>
              </g>
            </g>
          </svg>
        </div>ข้อมูลระบบ
      </template>
      <!-- <MenuItem name="setup-system" to="/system-management/setup-system">กำหนดการทำงานระบบ</MenuItem> -->
      <MenuItem name="company-profile" to="/system-management/company-profile">กำหนดข้อมูลบริษัท</MenuItem>
      <!-- <MenuItem name="start-system" to="/system-management/start-system">ข้อมูลเริ่มต้นระบบ</MenuItem> -->
      <!-- <MenuItem
        name="enquire-usage-system"
        to="/system-management/enquire-usage-system"
      >สอบถามการใช้งานระบบ</MenuItem>
      <MenuItem name="search-document" to="/system-management/search-document">ค้นหาการใช้งานเอกสาร</MenuItem> -->
    </Submenu>
  </Menu>
</template>

<script>
export default {
  data() {
    return {}
  },
  computed: {
    activeByUrl() {
      if (this.$route.name == 'index') {
        return 'dashboard'
      }
      if (this.$route.name == 'search') {
        return 'search'
      }
      if (this.$route.name == 'search-search-customer') {
        this.$store.commit('setMenuID', '3')
        return 'search-customer'
      }
      if (this.$route.name == 'search-search-car') {
        this.$store.commit('setMenuID', '4')
        return 'search-car'
      }
      if (this.$route.name == 'search-search-dealer') {
        this.$store.commit('setMenuID', '5')
        return 'search-dealer'
      }
      if (this.$route.name == 'search-search-product') {
        this.$store.commit('setMenuID', '6')
        return 'search-product'
      }
      if (this.$route.name == 'sales') {
        return 'sales'
      }
      if (this.$route.name == 'sales-service-request') {
        this.$store.commit('setMenuID', '8')
        return 'service-request'
      }
      if (this.$route.name == 'sales-tax-Invoice-abb') {
        this.$store.commit('setMenuID', '9')
        return 'tax-Invoice-abb'
      }
      if (this.$route.name == 'sales-temporary-order') {
        this.$store.commit('setMenuID', '10')
        return 'temporary-order'
      }
      if (this.$route.name == 'sales-tax-invoice') {
        this.$store.commit('setMenuID', '11')
        return 'tax-invoice'
      }
      if (this.$route.name == 'sales-return-order-slip') {
        this.$store.commit('setMenuID', '12')
        return 'return-order-slip'
      }
      if (this.$route.name == 'sales-quotation') {
        this.$store.commit('setMenuID', '13')
        return 'quotation'
      }
      if (this.$route.name == 'sales-deposit-slip') {
        this.$store.commit('setMenuID', '14')
        return 'deposit-slip'
      }
      if (this.$route.name == 'sales-car-inspection-list') {
        this.$store.commit('setMenuID', '15')
        return 'car-inspection-list'
      }
      if (this.$route.name == 'purchase') {
        this.$store.commit('setMenuID', '17')
        return 'purchase'
      }
      if (this.$route.name == 'warehouse') {
        return 'warehouse'
      }
      if (this.$route.name == 'warehouse-import-order') {
        this.$store.commit('setMenuID', '19')
        return 'import-order'
      }
      if (this.$route.name == 'warehouse-return-order') {
        this.$store.commit('setMenuID', '20')
        return 'return-order'
      }
      if (this.$route.name == 'warehouse-update-stock') {
        this.$store.commit('setMenuID', '21')
        return 'update-stock'
      }
      if (this.$route.name == 'warehouse-caim-product') {
        this.$store.commit('setMenuID', '22')
        return 'caim-product'
      }
      if (this.$route.name == 'warehouse-stocktaking') {
        this.$store.commit('setMenuID', '23')
        return 'stocktaking'
      }
      if (this.$route.name == 'cost-consumables') {
        return 'cost-consumables'
      }
      if (this.$route.name == 'cost-consumables-expense-sheet') {
        this.$store.commit('setMenuID', '25')
        return 'expense-sheet'
      }
      if (this.$route.name == 'cost-consumables-bill-of-supplies') {
        this.$store.commit('setMenuID', '26')
        return 'bill-of-supplies'
      }
      if (this.$route.name == 'withholding') {
        this.$store.commit('setMenuID', '28')
        return 'withholding'
      }
      if (this.$route.name == 'master-data') {
        return 'master-data'
      }
      if (this.$route.name == 'master-data-customer-profile') {
        this.$store.commit('setMenuID', '30')
        return 'customer-profile'
      }
      if (this.$route.name == 'master-data-dealer-profile') {
        this.$store.commit('setMenuID', '31')
        return 'dealer-profile'
      }
      if (this.$route.name == 'master-data-product-profile') {
        this.$store.commit('setMenuID', '32')
        return 'product-profile'
      }
      if (this.$route.name == 'master-data-old-product-profile') {
        this.$store.commit('setMenuID', '33')
        return 'old-product-profile'
      }
      if (this.$route.name == 'master-data-supplies-profile') {
        this.$store.commit('setMenuID', '34')
        return 'supplies-profile'
      }
      if (this.$route.name == 'master-data-set-product-profile') {
        this.$store.commit('setMenuID', '35')
        return 'set-product-profile'
      }
      if (this.$route.name == 'master-data-sale-price-profile') {
        this.$store.commit('setMenuID', '36')
        return 'sale-price-profile'
      }
      if (this.$route.name == 'master-data-vehicle-inspection-list') {
        this.$store.commit('setMenuID', '37')
        return 'vehicle-inspection-list'
      }
      if (this.$route.name == 'master-data-customer-price-group') {
        this.$store.commit('setMenuID', '38')
        return 'customer-price-group'
      }
      if (this.$route.name == 'master-data-employee-profile') {
        this.$store.commit('setMenuID', '39')
        return 'employee-profile'
      }
      if (
        this.$route.name == 'master-data-setting-master-data' ||
        'master-data/setting-master-data/product-group' ||
        'master-data/setting-master-data/product-type' ||
        'master-data/setting-master-data/product-brand' ||
        'master-data/setting-master-data/product-model' ||
        'master-data/setting-master-data/product-size' ||
        'master-data/setting-master-data/product-unit' ||
        'master-data/setting-master-data/location' ||
        'master-data/setting-master-data/dot' ||
        'master-data/setting-master-data/next-service' ||
        'master-data/setting-master-data/sub-next-service' ||
        'master-data/setting-master-data/car-type' ||
        'master-data/setting-master-data/car-brand' ||
        'master-data/setting-master-data/car-model' ||
        'master-data/setting-master-data/car-sub-model' ||
        'master-data/setting-master-data/car-checklist' ||
        'master-data/setting-master-data/car-gear' ||
        'master-data/setting-master-data/contact-type' ||
        'master-data/setting-master-data/business-type' ||
        'master-data/setting-master-data/reason-dec-inc' ||
        'master-data/setting-master-data/assessment' ||
        'master-data/setting-master-data/tag-status' ||
        'master-data/setting-master-data/document-type' ||
        'master-data/setting-master-data/bank-name' ||
        'master-data/setting-master-data/credit-card' ||
        'master-data/setting-master-data/cheque-type' ||
        'master-data/setting-master-data/credit-card-swipe' ||
        'master-data/setting-master-data/tax-rate' ||
        'master-data/setting-master-data/condition-withholding-tax' ||
        'master-data/setting-master-data/sort-withholding-tax' ||
        'master-data/setting-master-data/position'
      ) {
        this.$store.commit('setMenuID', '40')
        return 'setting-master-data'
      }
      if (this.$route.name == 'master-data-set-campaign') {
        return 'set-campaign'
      }
      if (this.$route.name == 'master-data-set-promotion') {
        return 'set-promotion'
      }
      if (this.$route.name == 'master-data-set-information-data') {
        return 'set-information-data'
      }
      if (this.$route.name == 'appointment') {
        this.$store.commit('setMenuID', '45')
        return 'appointment'
      }
      if (this.$route.name == 'crm') {
        return 'crm'
      }
      if (this.$route.name == 'crm-customer-relations') {
        this.$store.commit('setMenuID', '47')
        return 'customer-relations'
      }
      if (this.$route.name == 'crm-satisfaction-survey-form') {
        this.$store.commit('setMenuID', '48')
        return 'satisfaction-survey-form'
      }
      if (this.$route.name == 'crm-follow-up-result') {
        this.$store.commit('setMenuID', '49')
        return 'follow-up-result'
      }
      if (this.$route.name == 'receive-pay-cash-end-day') {
        return 'receive-pay-cash-end-day'
      }
      if (this.$route.name == 'receive-pay-cash-end-day-receive-pay-cash') {
        this.$store.commit('setMenuID', '51')
        return 'receive-pay-cash'
      }
      if (this.$route.name == 'receive-pay-cash-end-day-close-end-of-day') {
        this.$store.commit('setMenuID', '52')
        return 'close-end-of-day'
      }
      if (this.$route.name == 'payable-management') {
        return 'payable-management'
      }
      if (this.$route.name == 'payable-management-reimbursement-slip') {
        this.$store.commit('setMenuID', '54')
        return 'reimbursement-slip'
      }
      if (this.$route.name == 'payable-management-debt-repayment') {
        this.$store.commit('setMenuID', '55')
        return 'debt-repayment'
      }
      if (this.$route.name == 'payable-management-creditor-note') {
        this.$store.commit('setMenuID', '56')
        return 'creditor-notet'
      }
      if (this.$route.name == 'payable-management-creditor-entry') {
        this.$store.commit('setMenuID', '57')
        return 'creditor-entry'
      }
      if (this.$route.name == 'payable-management-purchase-debit-note') {
        this.$store.commit('setMenuID', '58')
        return 'purchase-debit-note'
      }
      if (this.$route.name == 'payable-management-purchase-debit-entry') {
        this.$store.commit('setMenuID', '59')
        return 'purchase-debit-entry'
      }
      if (this.$route.name == 'receivable-management') {
        return 'receivable-management'
      }
      if (this.$route.name == 'receivable-management-receivable-slip') {
        this.$store.commit('setMenuID', '61')
        return 'receivable-slip'
      }
      if (this.$route.name == 'receivable-management-repayment-slip') {
        this.$store.commit('setMenuID', '62')
        return 'repayment-slip'
      }
      if (this.$route.name == 'receivable-management-credit-note') {
        this.$store.commit('setMenuID', '63')
        return 'credit-note'
      }
      if (this.$route.name == 'receivable-management-credit-note-receipt') {
        this.$store.commit('setMenuID', '64')
        return 'credit-note-receipt'
      }
      if (this.$route.name == 'receivable-management-debit-note') {
        this.$store.commit('setMenuID', '65')
        return 'debit-note'
      }
      if (this.$route.name == 'receivable-management-debit-note-receipt') {
        this.$store.commit('setMenuID', '66')
        return 'debit-note-receipt'
      }
      if (this.$route.name == 'receivable-management-bill') {
        this.$store.commit('setMenuID', '67')
        return 'bill'
      }
      if (this.$route.name == 'cheque') {
        return 'cheque'
      }
      if (this.$route.name == 'cheque-accepting-cheque') {
        this.$store.commit('setMenuID', '69')
        return 'accepting-cheque'
      }
      if (this.$route.name == 'cheque-payment-cheque') {
        this.$store.commit('setMenuID', '70')
        return 'payment-cheque'
      }
      if (this.$route.name == 'cheque-search-bank-account') {
        this.$store.commit('setMenuID', '71')
        return 'search-bank-account'
      }
      if (this.$route.name == 'cheque-bank-account-information') {
        this.$store.commit('setMenuID', '72')
        return 'bank-account-information'
      }
      if (this.$route.name == 'report') {
        return 'report'
      }
      if (this.$route.name == 'system-management') {
        return 'system-management'
      }
      if (this.$route.name == 'system-management-setup-system') {
        this.$store.commit('setMenuID', '85')
        return 'setup-system'
      }
      if (this.$route.name == 'system-management-company-profile') {
        this.$store.commit('setMenuID', '86')
        return 'company-profile'
      }
      if (this.$route.name == 'system-management-start-system') {
        this.$store.commit('setMenuID', '87')
        return 'start-system'
      }
      if (this.$route.name == 'system-management-enquire-usage-system') {
        this.$store.commit('setMenuID', '88')
        return 'enquire-usage-system'
      }
      if (this.$route.name == 'system-management-search-document') {
        this.$store.commit('setMenuID', '89')
        return 'search-document'
      }
    }
  },
  created() {},
  mounted() {
    console.log(this.$route)
  }
}
</script>

<style lang="scss" scoped>
@function rem($size) {
  @return $size / 16px * 1rem;
}
</style>
